+++
title = "4h: Parsing (ASCII Glyphs)"
weight = 35

[glossaryEntry."Parse space"]
name = "Parse space"
symbol = "ace"
usage = "stdlib"
slug = "#ace"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse | (bar)"]
name = "Parse | (bar)"
symbol = "bar"
usage = "stdlib"
slug = "#bar"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse \\ (bas)"]
name = "Parse \\ (bas)"
symbol = "bas"
usage = "stdlib"
slug = "#bas"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse $ (buc)"]
name = "Parse $ (buc)"
symbol = "buc"
usage = "stdlib"
slug = "#buc"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse _ (cab)"]
name = "Parse _ (cab)"
symbol = "cab"
usage = "stdlib"
slug = "#cab"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse % (cen)"]
name = "Parse % (cen)"
symbol = "cen"
usage = "stdlib"
slug = "#cen"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse : (col)"]
name = "Parse : (col)"
symbol = "col"
usage = "stdlib"
slug = "#col"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse , (com)"]
name = "Parse , (com)"
symbol = "com"
usage = "stdlib"
slug = "#com"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse double quote"]
name = "Parse double quote"
symbol = "doq"
usage = "stdlib"
slug = "#doq"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse period"]
name = "Parse period"
symbol = "dot"
usage = "stdlib"
slug = "#dot"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse / (fas)"]
name = "Parse / (fas)"
symbol = "fas"
usage = "stdlib"
slug = "#fas"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse < (gal)"]
name = "Parse < (gal)"
symbol = "gal"
usage = "stdlib"
slug = "#gal"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse > (gar)"]
name = "Parse > (gar)"
symbol = "gar"
usage = "stdlib"
slug = "#gar"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse # (hax)"]
name = "Parse # (hax)"
symbol = "hax"
usage = "stdlib"
slug = "#hax"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse - (hep)"]
name = "Parse - (hep)"
symbol = "hep"
usage = "stdlib"
slug = "#hep"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse { (kel)"]
name = "Parse { (kel)"
symbol = "kel"
usage = "stdlib"
slug = "#kel"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse } (ker)"]
name = "Parse } (ker)"
symbol = "ker"
usage = "stdlib"
slug = "#ker"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ^ (ket)"]
name = "Parse ^ (ket)"
symbol = "ket"
usage = "stdlib"
slug = "#ket"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse + (lus)"]
name = "Parse + (lus)"
symbol = "lus"
usage = "stdlib"
slug = "#lus"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse & (pam)"]
name = "Parse & (pam)"
symbol = "pam"
usage = "stdlib"
slug = "#pam"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse @ (pat)"]
name = "Parse @ (pat)"
symbol = "pat"
usage = "stdlib"
slug = "#pat"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ( (pal)"]
name = "Parse ( (pal)"
symbol = "pal"
usage = "stdlib"
slug = "#pal"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ) (par)"]
name = "Parse ) (par)"
symbol = "par"
usage = "stdlib"
slug = "#par"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse [ (sel)"]
name = "Parse [ (sel)"
symbol = "sel"
usage = "stdlib"
slug = "#sel"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ; (mic)"]
name = "Parse ; (mic)"
symbol = "mic"
usage = "stdlib"
slug = "#mic"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ] (ser)"]
name = "Parse ] (ser)"
symbol = "ser"
usage = "stdlib"
slug = "#ser"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ~ (sig)"]
name = "Parse ~ (sig)"
symbol = "sig"
usage = "stdlib"
slug = "#sig"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ' (soq)"]
name = "Parse ' (soq)"
symbol = "soq"
usage = "stdlib"
slug = "#soq"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse * (tar)"]
name = "Parse * (tar)"
symbol = "tar"
usage = "stdlib"
slug = "#tar"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ` (tic)"]
name = "Parse ` (tic)"
symbol = "tic"
usage = "stdlib"
slug = "#tic"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse = (tis)"]
name = "Parse = (tis)"
symbol = "tis"
usage = "stdlib"
slug = "#tis"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ? (wut)"]
name = "Parse ? (wut)"
symbol = "wut"
usage = "stdlib"
slug = "#wut"
desc = "Used in the Hoon standard library."

[glossaryEntry."Parse ! (zap)"]
name = "Parse ! (zap)"
symbol = "zap"
usage = "stdlib"
slug = "#zap"
desc = "Used in the Hoon standard library."

+++

## `++ace`

Parse space

Parses ASCII character 32, space.

#### Source

```hoon
++  ace  (just ' ')
```

#### Examples

```
> (scan " " ace)
' '
```

---

## `++bar`

Parse vertical bar

Parses ASCII character 124, the vertical bar.

#### Source

```hoon
++  bar  (just '|')
```

#### Examples

```
> (scan "|" bar)
'|'
```

---

## `++bas`

Parse backslash

Parses ASCII character 92, the backslash. Note the extra `\` in the calling of
`bas` with [`just`](/reference/hoon/stdlib/4f#just) is to escape the escape
character, `\`.

#### Source

```hoon
++  bas  (just '\\')
```

#### Examples

```
> (scan "\\" bas)
'\\'
```

---

## `++buc`

Parse dollar sign

Parses ASCII character 36, the dollar sign.

#### Source

```hoon
++  buc  (just '$')
```

#### Examples

```
> (scan "$" buc)
'$'
```

---

## `++cab`

Parse underscore

Parses ASCII character 95, the underscore.

#### Source

```hoon
++  cab  (just '_')
```

#### Examples

```
> (scan "_" cab)
'_'
```

---

## `++cen`

Parses percent sign

Parses ASCII character 37, the percent sign.

#### Source

```hoon
++  cen  (just '%')
```

#### Examples

```
> (scan "%" cen)
'%'
```

---

## `++col`

Parse colon

Parses ASCII character 58, the colon

#### Source

```hoon
++  col  (just ':')
```

#### Examples

```
> (scan ":" col)
':'
```

---

## `++com`

Parse comma

Parses ASCII character 44, the comma.

#### Source

```hoon
++  com  (just ',')
```

#### Examples

```
> (scan "," com)
','
```

---

## `++doq`

Parse double quote

Parses ASCII character 34, the double quote.

#### Source

```hoon
++  doq  (just '"')
```

#### Examples

```
> (scan "\"" doq)
'"'
```

---

## `++dot`

Parse period

Parses ASCII character 46, the period.

#### Source

```hoon
++  dot  (just '.')
```

#### Examples

```
> (scan "." dot)
'.'
```

---

## `++fas`

Parse forward slash

Parses ASCII character 47, the forward slash.

#### Source

```hoon
++  fas  (just '/')
```

#### Examples

```
> (scan "/" fas)
'/'
```

---

## `++gal`

Parse less-than sign

Parses ASCII character 60, the less-than sign.

#### Source

```hoon
++  gal  (just '<')
```

#### Examples

```
> (scan "<" gal)
'<'
```

---

## `++gar`

Parse greater-than sign

Parses ASCII character 62, the greater-than sign.

#### Source

```hoon
++  gar  (just '>')
```

#### Examples

```
> (scan ">" gar)
'>'
```

---

## `++hax`

Parse number sign

Parses ASCII character 35, the number sign.

#### Source

```hoon
++  hax  (just '#')
```

#### Examples

```
> (scan "#" hax)
'#'
```

---

## `++hep`

Parse hyphen

Parses ASCII character 45, the hyphen.

#### Source

```hoon
++  hep  (just '-')
```

#### Examples

```
> (scan "-" hep)
'-'
```

---

## `++kel`

Parse left curley bracket

Parses ASCII character 123, the left curly bracket. Note that `{` (`kel`) opens
a Hoon expression for Hoon string interpolation. To parse it, therefore, it must
be escaped.

#### Source

```hoon
++  kel  (just '{')
```

#### Examples

```
> (scan "\{" kel)
'{'
```

---

## `++ker`

Parse right curley bracket

Parses ASCII character 125, the right curly bracket.

#### Source

```hoon
++  ker  (just '}')
```

#### Examples

```
> (scan "}" ker)
'}'
```

---

## `++ket`

Parse caret

Parses ASCII character 94, the caret.

#### Source

```hoon
++  ket  (just '^')
```

#### Examples

```
> (scan "^" ket)
'^'
```

---

## `++lus`

Parse plus sign

Parses ASCII character 43, the plus sign.

#### Source

```hoon
++  lus  (just '+')
```

#### Examples

```
> (scan "+" lus)
'+'
```

---

## `++mic`

Parse semicolon

Parses ASCII character 59, the semicolon.

#### Source

```hoon
++  mic  (just ';')
```

#### Examples

```
> (scan ";" mic)
';'
```

---

## `++pal`

Parse left parenthesis

Parses ASCII character 40, the left parenthesis.

#### Source

```hoon
++  pal  (just '(')
```

#### Examples

```
> (scan "(" pal)
'('
```

---

## `++pam`

Parse ampersand

Parses ASCII character 38, the ampersand.

#### Source

```hoon
++  pam  (just '&')
```

#### Examples

```
> (scan "&" pam)
'&'
```

---

## `++par`

Parse right parenthesis

Parses ASCII character 41, the right parenthesis.

#### Source

```hoon
++  par  (just ')')
```

#### Examples

```
> (scan ")" par)
')'
```

---

## `++pat`

Parse "at" sign

Parses ASCII character 64, the "at" sign.

#### Source

```hoon
++  pat  (just '@')
```

#### Examples

```
> (scan "@" pat)
'@'
```

---

## `++sel`

Parse left square bracket

Parses ASCII character 91, the left square bracket.

#### Source

```hoon
++  sel  (just '[')
```

#### Examples

```
> (scan "[" sel)
'['
```

---

## `++ser`

Parse right square bracket

Parses ASCII character 93, the right square bracket.

#### Source

```hoon
++  ser  (just ']')
```

#### Examples

```
> (scan "]" ser)
']'
```

---

## `++sig`

Parse tilde

Parses ASCII character 126, the tilde.

#### Source

```hoon
++  sig  (just '~')
```

#### Examples

```
> (scan "~" sig)
'~'
```

---

## `++soq`

Parse single quote

Parses ASCII character 39, soq. Note the `\` in the example is to escape the soq
because soq delimits a `cord`.

#### Source

```hoon
++  soq  (just '\'')
```

#### Examples

```
> (scan "'" soq)
'\''
```

---

## `++tar`

Parse asterisk

Parses ASCII character 42, the asterisk.

#### Source

```hoon
++  tar  (just '*')
```

#### Examples

```
> (scan "*" tar)
'*'
```

---

## `++tic`

Parse backtick

Parses ASCII character 96, the backtick.

#### Source

```hoon
++  tic  (just '`')
```

#### Examples

```
> (scan "`" tic)
'`'
```

---

## `++tis`

Parse equals sign

Parses ASCII character 61, the equals sign.

#### Source

```hoon
++  tis  (just '=')
```

#### Examples

```
> (scan "=" tis)
'='
```

---

## `++wut`

Parses question mark

Parses ASCII character 63, the question mark.

#### Source

```hoon
++  wut  (just '?')
```

#### Examples

```
> (scan "?" wut)
'?'
```

---

## `++zap`

Exclamation point

Parses ASCII character 33, the exclamation point zap.

#### Source

```hoon
++  zap  (just '!')
```

#### Examples

```
> (scan "!" zap)
'!'
```

---
